## 1. **Перевірка паролю:**
##    Завдання: Напишіть програму, яка встановлює початковий пароль і перевіряє, чи введений користувачем пароль співпадає з ним. Якщо пароль дорівнює "password123", виведіть повідомлення "Ви увійшли в систему". В іншому випадку виведіть повідомлення "Неправильний пароль".
#
# right_password = "password123"
# password = input("Введіть пароль:")
#
# while True:
#     if password != right_password:
#         print("Неправильний пароль")
#         password = input("Спробуйте ще раз:")
#     elif password == right_password:
#         print("Ви увійшли в систему")
#         break
#
## 2. **Визначення днів тижня:**
## Завдання: Створіть програму, яка встановлює номер дня тижня і виводить назву відповідного дня тижня. Якщо номер дня недійсний (менше 1 або більше 7), виведіть повідомлення про помилку.
#
# week = {1: "Понеділок", 2: "Вівторок", 3: "Середа", 4: "Четвер", 5: "П'ятниця", 6: "Суббота", 7: "неділя"}
#
#
# while True:
#     day = int(input("Введіть номер дня тижня (1-7): "))
#     if day < 1 or day > 7:
#         print("Неправильний вибір. Спробуйте ще раз.")
#     else:
#         print(week[day])
#
# ### Цикли:
## 1. **Таблиця множення:**
##    Завдання: Виведіть таблицю множення для заданого числа від 1 до 10.
#
# number = int(input("Введіть число:"))
#
# for i in range(1, 11):
#     print(f"{number} x {i} = {number * i}")
#
## 2. **Сума чисел:**
##    : Визначте список чисел і обчисліть їх суму.
#
# summ = 0
# for i in range(1, 11):
#     summ += i
# print(summ)
#
## 3. **Факторіал числа:**
##    Завдання: Обчисліть факторіал заданого числа.
#
# number = int(input("Enter a number: "))
#
# factorial = 1
# for i in range(1, number+1):
#     factorial = factorial*i
# print(factorial)
#
## 4. **Парні числа:**
##    Завдання: Виведіть всі парні числа від 1 до 50.
#
# for i in range(1, 51):
#     if i % 2 == 0:
#         print(i)
#
## 5. **Пошук простих чисел:**
##    Завдання: Знайдіть всі прості числа в заданому діапазоні.

# first_number = 1
# second_number = 50

# list = []
#
# for num in range(first_number, second_number+1):
#     if num > 1:
#         for i in range(2, num):
#             if num % i == 0:
#                 break
#         else:
#             list.append(num)
#
# print(f"Виведено тільки прості числа починаючи з {first_number} закінчуючи {second_number} : {list}")